[net]
height=224
width=224
channels=3

[convolutional]
filters=32
size=3
stride=2
pad=1
batch_normalize=0
activation=relu

[convolutional]
groups=32
filters=32
size=3
stride=1
pad=1
batch_normalize=0
activation=relu

[convolutional]
filters=16
size=1
stride=1
pad=0
batch_normalize=0
activation=linear

[convolutional]
filters=96
size=1
stride=1
pad=0
batch_normalize=0
activation=relu

[convolutional]
groups=96
filters=96
size=3
stride=2
pad=1
batch_normalize=0
activation=relu

[convolutional]
filters=24
size=1
stride=1
pad=0
batch_normalize=0
activation=linear

[convolutional]
filters=144
size=1
stride=1
pad=0
batch_normalize=0
activation=relu

[convolutional]
groups=144
filters=144
size=3
stride=1
pad=1
batch_normalize=0
activation=relu

[convolutional]
filters=24
size=1
stride=1
pad=0
batch_normalize=0
activation=linear

[shortcut]
from=-4
activation=linear

[convolutional]
filters=144
size=1
stride=1
pad=0
batch_normalize=0
activation=relu

[convolutional]
groups=144
filters=144
size=3
stride=2
pad=1
batch_normalize=0
activation=relu

[convolutional]
filters=32
size=1
stride=1
pad=0
batch_normalize=0
activation=linear

[convolutional]
filters=192
size=1
stride=1
pad=0
batch_normalize=0
activation=relu

[convolutional]
groups=192
filters=192
size=3
stride=1
pad=1
batch_normalize=0
activation=relu

[convolutional]
filters=32
size=1
stride=1
pad=0
batch_normalize=0
activation=linear

[shortcut]
from=-4
activation=linear

[convolutional]
filters=192
size=1
stride=1
pad=0
batch_normalize=0
activation=relu

[convolutional]
groups=192
filters=192
size=3
stride=1
pad=1
batch_normalize=0
activation=relu

[convolutional]
filters=32
size=1
stride=1
pad=0
batch_normalize=0
activation=linear

[shortcut]
from=-4
activation=linear

[convolutional]
filters=192
size=1
stride=1
pad=0
batch_normalize=0
activation=relu

[convolutional]
groups=192
filters=192
size=3
stride=2
pad=1
batch_normalize=0
activation=relu

[convolutional]
filters=64
size=1
stride=1
pad=0
batch_normalize=0
activation=linear

[convolutional]
filters=384
size=1
stride=1
pad=0
batch_normalize=0
activation=relu

[convolutional]
groups=384
filters=384
size=3
stride=1
pad=1
batch_normalize=0
activation=relu

[convolutional]
filters=64
size=1
stride=1
pad=0
batch_normalize=0
activation=linear

[shortcut]
from=-4
activation=linear

[convolutional]
filters=384
size=1
stride=1
pad=0
batch_normalize=0
activation=relu

[convolutional]
groups=384
filters=384
size=3
stride=1
pad=1
batch_normalize=0
activation=relu

[convolutional]
filters=64
size=1
stride=1
pad=0
batch_normalize=0
activation=linear

[shortcut]
from=-4
activation=linear

[convolutional]
filters=384
size=1
stride=1
pad=0
batch_normalize=0
activation=relu

[convolutional]
groups=384
filters=384
size=3
stride=1
pad=1
batch_normalize=0
activation=relu

[convolutional]
filters=64
size=1
stride=1
pad=0
batch_normalize=0
activation=linear

[shortcut]
from=-4
activation=linear

[convolutional]
filters=384
size=1
stride=1
pad=0
batch_normalize=0
activation=relu

[convolutional]
groups=384
filters=384
size=3
stride=1
pad=1
batch_normalize=0
activation=relu

[convolutional]
filters=96
size=1
stride=1
pad=0
batch_normalize=0
activation=linear

[convolutional]
filters=576
size=1
stride=1
pad=0
batch_normalize=0
activation=relu

[convolutional]
groups=576
filters=576
size=3
stride=1
pad=1
batch_normalize=0
activation=relu

[convolutional]
filters=96
size=1
stride=1
pad=0
batch_normalize=0
activation=linear

[shortcut]
from=-4
activation=linear

[convolutional]
filters=576
size=1
stride=1
pad=0
batch_normalize=0
activation=relu

[convolutional]
groups=576
filters=576
size=3
stride=1
pad=1
batch_normalize=0
activation=relu

[convolutional]
filters=96
size=1
stride=1
pad=0
batch_normalize=0
activation=linear

[shortcut]
from=-4
activation=linear

[convolutional]
filters=576
size=1
stride=1
pad=0
batch_normalize=0
activation=relu

[convolutional]
groups=576
filters=576
size=3
stride=2
pad=1
batch_normalize=0
activation=relu

[convolutional]
filters=160
size=1
stride=1
pad=0
batch_normalize=0
activation=linear

[convolutional]
filters=960
size=1
stride=1
pad=0
batch_normalize=0
activation=relu

[convolutional]
groups=960
filters=960
size=3
stride=1
pad=1
batch_normalize=0
activation=relu

[convolutional]
filters=160
size=1
stride=1
pad=0
batch_normalize=0
activation=linear

[shortcut]
from=-4
activation=linear

[convolutional]
filters=960
size=1
stride=1
pad=0
batch_normalize=0
activation=relu

[convolutional]
groups=960
filters=960
size=3
stride=1
pad=1
batch_normalize=0
activation=relu

[convolutional]
filters=160
size=1
stride=1
pad=0
batch_normalize=0
activation=linear

[shortcut]
from=-4
activation=linear

[convolutional]
filters=960
size=1
stride=1
pad=0
batch_normalize=0
activation=relu

[convolutional]
groups=960
filters=960
size=3
stride=1
pad=1
batch_normalize=0
activation=relu

[convolutional]
filters=320
size=1
stride=1
pad=0
batch_normalize=0
activation=linear

[convolutional]
filters=1280
size=1
stride=1
pad=0
batch_normalize=0
activation=relu

[avgpool]
size=7
stride=1

[convolutional]
filters=1000
size=1
stride=1
pad=0
batch_normalize=0
activation=linear

